Revit 2027 API
SiteLocation.PlaceName Property
 The place name of the site.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PlaceName { get; set; }
Public Property PlaceName As String
	Get
	Set
public:
property String^ PlaceName {
	String^ get ();
	void set (String^ value);
}
member PlaceName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace